app/controllers/api/v1/currency_controller.rb

      def get_exchange_rates
        # Optional date param, defaults to today
        date = params[:date] || Date.today.to_s

        # Query for rates where fetched_at falls on the given date (ignoring time)
        rates = ExchangeRate.where("DATE(fetched_at) = ?", date)

        if rates.present?
---
SELECT `exchange_rates`.* FROM `exchange_rates` WHERE `exchange_rates`.`date` = '2024-09-22'
SELECT `exchange_rates`.* FROM `exchange_rates` WHERE (DATE(fetched_at) = '2024-09-22')