app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('testuser', 'testuser@example.com', '$2a$12$6XdpQEN8f9WrzdXLmvPyGO7lF9DvaeNrIc3fjWJ9zaD4OH1YAMF9O', '2024-09-20 11:56:24.373092', '2024-09-20 11:56:24.373092')
---
      def create
        user = User.new(user_params)
        if user.save