app/controllers/application_controller.rb

  def current_user
    if decoded_token
      user_id = decoded_token[0]["user_id"]
      Rails.logger.info "Decoded Token User ID: #{user_id}" # Log user ID from token
      @current_user ||= User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1